hacperme/rt-thread/bsp/stm32/encortec/application/board/cloud/business.c
#include "nbiot.h"
#include "gnss.h"
#include "lpm.h"
#include "voltage.h"
#include "tmp116.h"
#include "hdc3021.h"
#include "fdc1004.h"
#include "adxl372.h"
#include <string.h>
#include "cJSON.h"
#include "at_client_ssl.h"
#include "control.h"
#include "data_save_as_file.h"
#include <time.h>
#include <unistd.h>
#include <stdio.h>
#include "settings.h"
#include <math.h>
#include <dirent.h>

#include "logging.h"
// #define DBG_TAG "business"
// #define DBG_LVL DBG_LOG
// #include <rtdbg.h>

static settings_t settings = {0};
static settings_params_t *settings_params = NULL;

static int start_tick_ms = 0;
static int end_tick_ms = 0;

struct FileSystem fs;

/*status defines*/
enum {
    RECORD_WAKEUP_SROUCE,
    EXTERNAL_DEVICES_INIT,
    COLLECT_SENSOR_DATA,
    SAVE_SENSOR_DATA,
    NBIOT_INIT,
    NBIOT_WAIT_NETWORK_RDY,
    NBIOT_WAIT_SERVER_CONNECT,
    NBIOT_REPORT_CONTROL_DATA,
    NBIOT_REPORT_SENSOR_DATA,
    CAT1_INIT,
    CAT1_WAIT_NETWORK_RDY,
    CAT1_UPLOAD_FILE,
    SLEEP,
};

static rt_sem_t stm32_sleep_ack_sem = RT_NULL;
void adxl372_inact_event_handler(void)
{
    // log_debug("adxl372_inact_event_handler called");
    rt_sem_release(stm32_sleep_ack_sem);
    adxl372_int1_pin_irq_disable();
}

enum wakeup_source_type {RTC_SOURCE, SHAKE_SOURCE, OTHER_SOURCE};
enum wakeup_source_type wakeup_source_flag = -1;
int record_wakeup_source()
{
    log_debug("record wakeup source");
    rt_uint8_t source = get_wakeup_source();
    if (is_rtc_wakeup(&source)) {
        wakeup_source_flag = RTC_SOURCE;  // rtc
    }
    else if (is_pin_wakeup(&source)) {
        wakeup_source_flag = SHAKE_SOURCE;  // shake
    }
    else {
        wakeup_source_flag = OTHER_SOURCE;
    }
    log_debug("wakeup souce flag: %d", wakeup_source_flag);
    return 0;
}

int external_devices_init()
{
    log_debug("external devices init");
    rt_err_t res = RT_EOK;

    //TODO: check file system `GNSS.reported`
    sensor_pwron_pin_enable(PIN_HIGH);
    nbiot_power_off();
    cat1_power_off();
    esp32_power_off();
    gnss_open();

    rt_uint16_t milliscond = 520;
    rt_uint16_t threshold = 10;  // 0.1 g
    rt_uint8_t measure_val = 0x03;
    rt_uint8_t odr_val = 0x60;
    rt_uint8_t hpf_val = 0x03;

    res = adxl372_init();
    log_debug("adxl372_init %s", res != RT_EOK ? "failed" : "success");
    res = adxl372_set_measure_config(&measure_val, &odr_val, &hpf_val);
    log_debug(
        "adxl372_set_measure_config(measure_val=0x%02X, odr_val=0x%02X, hpf_val=0x%02X) %s",
        measure_val, odr_val, hpf_val, res != RT_EOK ? "failed" : "success"
    );

    return 0;
}

struct SensorData
{
    float temp1;
    float temp2;
    float temp3;
    float humi;
    float lat;
    float lng;
    float acc_x;
    float acc_y;
    float acc_z;
    float water_level;
    int cur_vol;
    int vcap_vol;
    int vbat_vol;
};
struct SensorData sensor_data = {0};
static struct rt_i2c_bus_device *iic_dev;
char nmea_buf[1024] = {0};
float ACC_XYZ_BUFF[1024][3] = {0};
int read_acc_xyz_result = RT_EOK;
int collect_sensor_data()
{
    rt_err_t res = RT_EOK;
    log_debug("collect sensor data");
    iic_dev = rt_i2c_bus_device_find("i2c1");

    if (wakeup_source_flag != RTC_SOURCE) {
        read_acc_xyz_result = adxl372_measure_acc(ACC_XYZ_BUFF, 1024);
        log_debug("adxl372_measure_acc %s", read_acc_xyz_result == RT_EOK ? "success" : "failed");

        // read cur_vol, vcap_vol, vbat_vol
        rt_uint16_t cur_vol = 0;
        rt_uint16_t vcap_vol = 0;
        rt_uint16_t vbat_vol = 0;
        res = cur_vol_read(&cur_vol);
        log_debug("cur_vol_read %s, cur_vol %dmv", res == RT_EOK ? "success" : "failed", cur_vol);
        res = vcap_vol_read(&vcap_vol);
        log_debug("vcap_vol_read %s, vcap_vol %dmv", res == RT_EOK ? "success" : "failed", vcap_vol);
        res = vbat_vol_read(&vbat_vol);
        log_debug("vbat_vol_read %s, vbat_vol %dmv", res == RT_EOK ? "success" : "failed", vbat_vol);
        sensor_data.cur_vol = cur_vol;
        sensor_data.vcap_vol = vcap_vol;
        sensor_data.vbat_vol = vbat_vol;
    }
    
    // temp1, temp2
    float temp1 = 0.0;
    float temp2 = 0.0;
    rt_uint8_t addrs[2] = {TMP116_1_ADDR, TMP116_2_ADDR};

    res = temp116_read_temperture(iic_dev, addrs[0], &temp1);
    log_debug("temp116_read_temperture %s, temp3=%f", RT_EOK ? "failed" : "success", temp1);

    res = temp116_read_temperture(iic_dev, addrs[1], &temp2);
    log_debug("temp116_read_temperture %s, temp3=%f", res != RT_EOK ? "failed" : "success", temp2);

    if (res == RT_EOK) {
        sensor_data.temp1 = temp1;
        sensor_data.temp2 = temp2;
    }

    // temp3, humi
    float temp3 = 0.0;
    float humi = 0.0;
    res = hdc3021_read_temp_humi(iic_dev, &temp3, &humi);
    log_debug("hdc3021_read_temp_humi %s, temp3=%f, humi=%f", res != RT_EOK ? "failed" : "success", temp3, humi);

    if (res == RT_EOK) {
        sensor_data.temp3 = temp3;
        sensor_data.humi = humi;
    }

    if (wakeup_source_flag != RTC_SOURCE) {
        // water level
        float value = 0.0;
        res = fdc1004_meas_data(iic_dev, &value);
        log_debug("fdc1004_meas_data %s, value=%f", res != RT_EOK ? "failed" : "success", value);
        if (res == RT_EOK) {
            sensor_data.water_level = value;
        }

        // read nmea
        nmea_item nmea_item = {0};
        for (int i=0; i < 30; i++) {
            rt_memset(&nmea_item, 0, sizeof(nmea_item));
            gnss_read_nmea_item(&nmea_item, 1000);
            if (nmea_item.is_valid) {
                rt_memcpy(nmea_buf, nmea_item.GNGGA, rt_strlen(nmea_item.GNGGA));
                log_debug("gnss_read_nmea_item %s", res == RT_EOK ? "success" : "failed");
                log_debug("nmea_item->GNRMC: %s", nmea_item.GNRMC);
                log_debug("nmea_item->is_valid: %d", nmea_item.is_valid);
                log_debug("nmea_item->GNGGA: %s", nmea_item.GNGGA);
                log_debug("nmea_item->GNGLL: %s", nmea_item.GNGLL);
                log_debug("nmea_item->GNVTG: %s", nmea_item.GNVTG);
                log_debug("nmea_item->GNGSA_SIZE: %d", nmea_item.GNGSA_SIZE);
                break;
            }
            rt_thread_mdelay(1000);
        }
    }

