hacperme/rt-thread/bsp/stm32/encortec/application/board/cloud/business.c
    return 0;
}

static int set_network_config_flag = 0;
static int nbiot_wait_network_retry_times = 0;
static struct datetime current_time;
static char report_timestamp_buf[64] = {0};

enum nbiot_network_status {
    NBIOT_NETWORK_RDY,
    NBIOT_NETWORK_NOT_RDY,
    NBIOT_NETWORK_RETRY
};

enum nbiot_network_status nbiot_wait_network_ready()
{
    if (nbiot_wait_network_retry_times >= 3) {
        log_debug("nbiot_wait_network_retry_times >= 3, goto sleep");
        return NBIOT_NETWORK_NOT_RDY;
    }
    nbiot_wait_network_retry_times += 1;

    log_debug("nbiot wait network ready");

    nbiot_enable_echo(0);
    if (nbiot_check_network(10) == RT_EOK) {
        log_debug("nbiot network has been ready");
        rt_err_t result = RT_EOK;
        result = nbiot_get_current_datetime(&current_time);
        log_debug("current_time.year: %d", current_time.year);
        log_debug("current_time.month: %d", current_time.month);
        log_debug("current_time.day: %d", current_time.day);
        log_debug("current_time.hour: %d", current_time.hour);
        log_debug("current_time.minute: %d", current_time.minute);
        log_debug("current_time.second: %d", current_time.second);
        result = rtc_set_datetime(current_time.year + 2000, current_time.month, current_time.day, current_time.hour, current_time.minute, current_time.second);
        log_debug("set rtc time result: %d", result);
        return NBIOT_NETWORK_RDY;
    }
    else {
        if (! set_network_config_flag) {
            struct network_config config = {"QUECTEL.VF.LPWA", "2,8,20", "3,0"};
            if(nbiot_set_network_config(&config) == RT_EOK) {
                log_debug("nbiot_set_network_config success");
                set_network_config_flag = 1;
            }
            else {
                log_debug("nbiot_set_network_config failed");
            }
        }
        return NBIOT_NETWORK_RETRY;
    }
}

static int set_lwm2m_config_flag = 0;
static int nbiot_wait_server_connect_retry_times = 0;

enum nbiot_server_connect_status {
    NBIOT_SERVER_CONNECT_RDY,
    NBIOT_SERVER_CONNECT_NOT_RDY,
    NBIOT_SERVER_CONNECT_RETRY
};

int nbiot_wait_server_connect_ready()
{
    if (nbiot_wait_server_connect_retry_times >= 5) {
        log_debug("nbiot_wait_server_connect_retry_times >= 5, goto sleep");
        return NBIOT_SERVER_CONNECT_NOT_RDY;
    }
    nbiot_wait_server_connect_retry_times += 1;

    log_debug("nbiot wait server connect");
    rt_err_t result = RT_EOK;

    if (nbiot_check_qiotstate() == RT_EOK) {
        // server connect ok, goto report control data to server
        return NBIOT_SERVER_CONNECT_RDY;
    }
    else {
        nbiot_lwm2m_deregister();
        struct lwm2m_config config = {"pe15TE", "aXp5Y0hudFBkbmho", 0, "coap://iot-south.quecteleu.com:5683", 180, 1, 1, 1};
        if (! set_lwm2m_config_flag && nbiot_check_lwm2m_config(&config) != RT_EOK) {
            if (nbiot_set_lwm2m_config(&config) == RT_EOK) {
                set_lwm2m_config_flag = 1;
                log_debug("nbiot_set_lwm2m_config success");
            }
            else {
                log_debug("nbiot_set_lwm2m_config failed");
            }
        }
        // connect failed, but network ready
        if (nbiot_check_network(1) == RT_EOK) {
            nbiot_lwm2m_register();
            return NBIOT_SERVER_CONNECT_RETRY;
        }
        else {
            // connect failed and network not ready
            return NBIOT_NETWORK_RETRY;
        }
    }
}

static int nbiot_report_ctrl_retry_times = 0;
static struct ServerCtrlData server_ctrl_data = {0};

enum nbiot_report_ctrl_data_status {
    NBIOT_REPORT_CTRL_DATA_SUCCESS,
    NBIOT_REPORT_CTRL_DATA_FAILED,
    NBIOT_REPORT_CTRL_DATA_RETRY
};

extern cJSON *read_json_obj_from_file(const char *file_path);
char nbiot_imei_string[16] = {0};
int nbiot_report_ctrl_data_to_server()
{
    if (nbiot_report_ctrl_retry_times >= 3) {
        log_debug("nbiot_report_ctrl_retry_times >= 3, goto report sensor data");
        return NBIOT_REPORT_CTRL_DATA_FAILED;
    }
    nbiot_report_ctrl_retry_times += 1;

    log_debug("nbiot report ctrl data to server");

    cJSON *data = cJSON_CreateObject();
    cJSON_AddNumberToObject(data, "12", settings_params->collect_interval);  // Cat1 Collect Interval
    cJSON_AddStringToObject(data, "24", "300");  // Cat1 File Upload

    // WIFI_Config
    if (strlen(nbiot_imei_string) == 0) {
        if (get_nbiot_imei(nbiot_imei_string) != RT_EOK) {
            memset(nbiot_imei_string, 0, sizeof(nbiot_imei_string));
            memcpy(nbiot_imei_string, "123456", 6);
        }
    }
    char ssid_string[64] = {0};
    sprintf(ssid_string, "encortec-%s", nbiot_imei_string + 9);
    char pwd_string[64] = "123456";
    cJSON *wifi_config = cJSON_CreateObject();
    cJSON_AddStringToObject(wifi_config, "1", ssid_string);
    cJSON_AddStringToObject(wifi_config, "2", pwd_string);
    cJSON_AddItemToObject(data, "3", wifi_config);

    // upload files
    cJSON *file_upload_event = read_json_obj_from_file("/upload_files.json");
    if (file_upload_event) {
        log_debug("no upload json files");
        cJSON_AddItemToObject(data, "22", file_upload_event);
        remove("/upload_files.json");
    }

    char *data_string = cJSON_PrintUnformatted(data);
    log_debug("data_string: %s", data_string);
    cJSON_Delete(data);

    rt_err_t result = nbiot_report_ctrl_data(data_string, rt_strlen(data_string));
    free(data_string);

    if (result == RT_EOK) {
        nbiot_recv_ctrl_data(64, &server_ctrl_data);  // read ctrl data from server
        log_debug("server_ctrl_data.CollectInterval: %d", server_ctrl_data.CollectInterval);
        log_debug("server_ctrl_data.Esp32_AP_Switch: %d", server_ctrl_data.Esp32_AP_Switch);
        log_debug("server_ctrl_data.Cat1_File_Upload_File_Times: %s", server_ctrl_data.Cat1_File_Upload_File_Times);
        log_debug("server_ctrl_data.Cat1_File_Upload_File_Type: %d", server_ctrl_data.Cat1_File_Upload_File_Type);
        log_debug("server_ctrl_data.Cat1_File_Upload_Switch: %d", server_ctrl_data.Cat1_File_Upload_Switch);
        log_debug("report ctrl data to server success, goto, report sensor data");
        settings_params_t p = {0};
        if (server_ctrl_data.CollectInterval != 0) {
            p.collect_interval = server_ctrl_data.CollectInterval;
            settings_update(&settings, &p);
        }
        return NBIOT_REPORT_CTRL_DATA_SUCCESS;
    }
    else {
        log_debug("report ctrl data to server falied");
        if (nbiot_check_qiotstate() == RT_EOK) {
            return NBIOT_REPORT_CTRL_DATA_RETRY;
        }
        else {
            log_debug("lwm2m server connect error, goto wait server connect");
            return NBIOT_SERVER_CONNECT_RETRY;
        }
    }
}

static int nbiot_report_sensor_data_retry_times = 0;

enum nbiot_report_sensor_data_status {
    NBIOT_REPORT_SENSOR_DATA_SUCCESS,
    NBIOT_REPORT_SENSOR_DATA_FAILED,
    NBIOT_REPORT_SENSOR_DATA_RETRY
};

