hacperme/rt-thread/bsp/stm32/encortec/application/board/cloud/business.c
int nbiot_report_sensor_data_to_server()
{
    if (nbiot_report_sensor_data_retry_times >= 3) {
        log_debug("nbiot_report_sensor_data_retry_times >= 3, goto cat1 upload file");
        return NBIOT_REPORT_SENSOR_DATA_FAILED;
    }
    nbiot_report_sensor_data_retry_times += 1;
    
    log_debug("nbiot report sensor data to server");

    if (rt_strlen(nmea_buf) > 0) {
        log_debug("send nmea_buf data!");
        nbiot_set_qiotlocext(nmea_buf);
    }
    else {
        log_debug("nmea_buf char is NULL");
    }

    cJSON *data = cJSON_CreateObject();
    cJSON_AddNumberToObject(data, "1", sensor_data.temp1);  // Rail temperature 1
    cJSON_AddNumberToObject(data, "5", sensor_data.temp2);  // Rail temperature 2
    cJSON_AddNumberToObject(data, "11", sensor_data.temp3);  // Air temperature
    cJSON_AddNumberToObject(data, "2", sensor_data.humi);  // Humidity
    cJSON_AddNumberToObject(data, "14", wakeup_source_flag);  // Wake up Source Flag
    
    if (wakeup_source_flag != RTC_SOURCE) {
        // Acceleration
        cJSON *acc = cJSON_CreateObject();
        cJSON_AddNumberToObject(acc, "1", sensor_data.acc_x);
        cJSON_AddNumberToObject(acc, "2", sensor_data.acc_y);
        cJSON_AddNumberToObject(acc, "3", sensor_data.acc_z);
        cJSON_AddItemToObject(data, "19", acc);

        cJSON_AddNumberToObject(data, "15", sensor_data.water_level);  // Water Level
        cJSON_AddNumberToObject(data, "16", sensor_data.cur_vol);  // Conversion voltage
        cJSON_AddNumberToObject(data, "17", sensor_data.vcap_vol);  // Capacitance voltage
        cJSON_AddNumberToObject(data, "18", sensor_data.vbat_vol);  // Battery voltage
        cJSON_AddNumberToObject(data, "20", 26);  // NB RSSI
    }

    char *data_string = cJSON_PrintUnformatted(data);
    rt_err_t result = nbiot_report_model_data(data_string, rt_strlen(data_string));
    cJSON_Delete(data);
    free(data_string);

    if (result == RT_EOK) {
        return NBIOT_REPORT_SENSOR_DATA_SUCCESS;
    }
    else {
        if (nbiot_check_qiotstate() == RT_EOK) {
            return NBIOT_REPORT_SENSOR_DATA_RETRY;
        }
        else {
            return NBIOT_SERVER_CONNECT_RETRY;
        }
    }
}

enum cat1_network_status {
    CAT1_NETWORK_RDY,
    CAT1_NETWORK_NOT_RDY,
    CAT1_NETWORK_ERROR
};
static int set_cat1_network_config_flag = 0;
static int cat1_wait_network_retry_times = 0;
enum cat1_network_status cat1_wait_network_ready()
{
    if (cat1_wait_network_retry_times >= 3) {
        log_debug("cat1_wait_network_retry_times >= 3, goto sleep");
        return CAT1_NETWORK_ERROR;
    }
    cat1_wait_network_retry_times += 1;

    cat1_enable_echo(0);
    // wait network ready for cat1
    if (cat1_check_network(10) != RT_EOK) {
        log_debug("cat1 network not ready");

        if (! set_cat1_network_config_flag) {
            if(cat1_set_network_config() == RT_EOK) {
                log_debug("cat1_set_network_config success");
                set_cat1_network_config_flag = 1;
            }
            else {
                log_debug("cat1_set_network_config failed");
            }
        }

        return CAT1_NETWORK_NOT_RDY;
    }
    else {
        log_debug("cat1 network ready");
        return CAT1_NETWORK_RDY;
    }
}

enum cat1_upload_file_status {
    CAT1_UPLOAD_FILE_SUCCESS,
    CAT1_UPLOAD_FILE_FAILED,
    CAT1_UPLOAD_FILE_ERROR
};

int split_string_in_place(char *s)
{
    int lines = 0;
    while (*s != '\0') {
        if (*s == ',') {
            *s = '\0';
            lines++;
        }
        s++;
    }
    return lines + 1;
}

static int cat1_upload_file_retry_times = 0;
extern int at_https_upload_file(const char *filename);
extern void save_json_obj_to_file(const char *file_path, cJSON *root);
int cat1_upload_file()
{
    if (cat1_upload_file_retry_times >= 3) {
        log_debug("cat1_upload_file_retry_times >= 3, goto sleep");
        return CAT1_UPLOAD_FILE_ERROR;
    }
    cat1_upload_file_retry_times += 1;

    rt_err_t result = RT_EOK;

    char parent_dir[20] = {0};
    memset(parent_dir, 0, sizeof(parent_dir));
    if (server_ctrl_data.Cat1_File_Upload_File_Type == 0) {  // 数据文件
        strcat(parent_dir, "/data");
    }
    else if (server_ctrl_data.Cat1_File_Upload_File_Type == 1) { // 系统文件
        strcat(parent_dir, "/log");
    }
    else {

    }

    log_debug("cat1 upload file parent_dir dir: %s", parent_dir);
    int nums = split_string_in_place(server_ctrl_data.Cat1_File_Upload_File_Times);
    log_debug("got sub dir nums: %d", nums);

    char *sub_dir = server_ctrl_data.Cat1_File_Upload_File_Times;
    char target_dir[128] = {0};
    char upload_file_path[128] = {0};
    DIR *dir;
    struct dirent *ent;
    cJSON *root = cJSON_CreateObject();
    cJSON *array = cJSON_CreateArray();
    char upload_file_name[64] = {0};
    cJSON *temp_obj;

    for (int i=1; i <= nums; i++) {
        log_debug("got sub_dir %d: %s", i, sub_dir);
        if (!strlen(sub_dir)) {
            continue;
        }

        memset(target_dir, 0, sizeof(target_dir));
        sprintf(target_dir, "%s/%s", parent_dir, sub_dir);
        log_debug("got target dir: %s", target_dir);

        // 遍历文件 for test
        // list_files(target_dir);
        log_debug("----- uploading dir \"%s\" files: ------", target_dir);
        if ((dir = opendir(target_dir)) != NULL) {
            while ((ent = readdir(dir)) != NULL) {
                memset(upload_file_path, 0, sizeof(upload_file_path));
                sprintf(upload_file_path, "%s/%s", target_dir, ent->d_name);
                log_debug("uploading file \"%s\", %d Bytes", upload_file_path, get_file_size(upload_file_path));

                if (at_https_upload_file(upload_file_path) == -1) {
                    log_debug("at https upload file failed");
                }
                else {
                    log_debug("at https upload \"%s\" success", upload_file_path);
                    remove(upload_file_path);
                    memset(upload_file_name, 0, sizeof(upload_file_name));
                    sprintf(upload_file_name, "%s/%s", "iot-encortec", ent->d_name);
        
