hacperme/rt-thread/bsp/stm32/encortec/application/board/cloud/business.c
                    temp_obj = cJSON_CreateObject();
                    cJSON_AddStringToObject(temp_obj, "1", sub_dir);
                    cJSON_AddStringToObject(temp_obj, "2", upload_file_name);
                    cJSON_AddNumberToObject(temp_obj, "3", server_ctrl_data.Cat1_File_Upload_File_Type);
                    cJSON_AddItemToArray(array, temp_obj);
                }
            }
            closedir(dir);
        }
        log_debug("----- uploading dir \"%s\" completed ------", target_dir);

        sub_dir += (strlen(sub_dir) + 1);
    }

    if (cJSON_GetArraySize(array) > 0) {
        cJSON_AddItemToObject(root, "23", array);
        save_json_obj_to_file("/upload_files.json", root);
    }
    cJSON_Delete(root);

    return CAT1_UPLOAD_FILE_SUCCESS;
}

static int DEFAULT_REMAINING_SECONDS = 600;
void stm32_sleep()
{   
    log_debug("wait stm32_sleep_ack_sem release");
    rt_sem_take(stm32_sleep_ack_sem, rt_tick_from_millisecond(1000));
    log_debug("go into sleep");

    esp32_power_off();
    gnss_close();
    cat1_deinit();

    end_tick_ms = rt_tick_get_millisecond();
    log_debug("start tick ms: %d", start_tick_ms);
    log_debug("end tick ms: %d", end_tick_ms);
    log_debug("settings_params->collect_interval: %d", settings_params->collect_interval);

    int remaining = 0;
    remaining = settings_params->collect_interval - ((end_tick_ms - start_tick_ms) / 1000);
    log_debug("remaining: %d", remaining);
    rtc_set_wakeup(remaining > 0 ? remaining : 10);
    shut_down();
}

char sensor_data_buffer[4096] = {0};
void save_sensor_data()
{
    int length = 0;
    char temp_buf[128] = {0};
    log_debug("save sensor data");
    
    snprintf(
        sensor_data_buffer + strlen(sensor_data_buffer), 
        sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), 
        "timestamp: %d/%02d/%02d %02d:%02d:%02d\r\n",
        current_time.year + 2000,
        current_time.month,
        current_time.day,
        current_time.hour,
        current_time.minute,
        current_time.second
    );

    // temperature1: 25.0
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "temperature1: %0.2f\r\n", sensor_data.temp1);

    // temperature2: 25.0
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "temperature2: %0.2f\r\n", sensor_data.temp2);

    // temperature3: 25.0
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "temperature3: %0.2f\r\n", sensor_data.temp3);

    // humidity: 56
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "humidity: %0.2f\r\n", sensor_data.humi);

    // water_level: 2.0
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "water_level: %0.2f\r\n", sensor_data.water_level);

    // vbat: 3.6
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "vbat: %d\r\n", sensor_data.vbat_vol);

    // vcur: 2.9
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "vcur: %d\r\n", sensor_data.cur_vol);

    // vcap: 3.3
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "vcap: %d\r\n", sensor_data.vcap_vol);

    // GNSS: $GNGGA:,,,,,,GNSS:
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "GNSS: ");
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), nmea_buf);
    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "\r\n");

    // log_debug("sensor_data_buffer:\r\n%s", sensor_data_buffer);
    data_save_as_file(&fs, sensor_data_buffer, strlen(sensor_data_buffer), true, false);
    memset(sensor_data_buffer, 0, sizeof(sensor_data_buffer));

    log_debug("read_acc_xyz_result: %d", read_acc_xyz_result);

    if (read_acc_xyz_result == RT_EOK)
    {
        snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), "acceleration:\r\n");
        for (rt_uint16_t i = 0; i < 1024; i++)
        {   
            if (fabs(ACC_XYZ_BUFF[i][0]) > fabs(sensor_data.acc_x)) {
                log_debug("set acc_x %f", ACC_XYZ_BUFF[i][0]);
                sensor_data.acc_x = ACC_XYZ_BUFF[i][0];
            }

            if (fabs(ACC_XYZ_BUFF[i][1]) > fabs(sensor_data.acc_y)) {
                log_debug("set acc_y %f", ACC_XYZ_BUFF[i][1]);
                sensor_data.acc_y = ACC_XYZ_BUFF[i][1];
            }

            if (fabs(ACC_XYZ_BUFF[i][2]) > fabs(sensor_data.acc_z)) {
                log_debug("set acc_z %f", ACC_XYZ_BUFF[i][2]);
                sensor_data.acc_z = ACC_XYZ_BUFF[i][2];
            }

            rt_memset(temp_buf, 0, 128);
            length = sprintf(temp_buf, "%0.2f,%0.2f,%0.2f\r\n", ACC_XYZ_BUFF[i][0], ACC_XYZ_BUFF[i][1], ACC_XYZ_BUFF[i][2]);
            // log_debug("temp_buf: %s", temp_buf);
            // 循环写三轴数据
            if (strlen(sensor_data_buffer) + length > sizeof(sensor_data_buffer)) {
                if (data_save_as_file(&fs, sensor_data_buffer, strlen(sensor_data_buffer), true, true) == 0) {
                    log_debug("Data saved successfully.");
                    rt_memset(sensor_data_buffer, 0, sizeof(sensor_data_buffer));
                    snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), temp_buf);
                } else {
                    log_error("Data saved failed.");
                    // 本次写入失败，重试写入，最多重试3次?
                }
            }
            else {
                snprintf(sensor_data_buffer + strlen(sensor_data_buffer), sizeof(sensor_data_buffer) - strlen(sensor_data_buffer), temp_buf);
            }
        }
    }

    // 删除超过30天的文件
    delete_old_dirs(&fs);
}

