hacperme/rt-thread/bsp/stm32/encortec/application/board/cloud/business.c
static rt_mq_t sm_mq = NULL;

static void sm_set_status(int status) {
    rt_mq_send(sm_mq, &status, sizeof(int));
}

static int sm_get_status(void) {
    int status = -1;
    rt_mq_recv(sm_mq, &status, sizeof(int), RT_WAITING_FOREVER);
    return status;
}

static void sm_set_initial_status(int status) {
    sm_set_status(status);
}

static void sm_init(void) {
    sm_mq = rt_mq_create("sm_mq", 16, 8, RT_IPC_FLAG_FIFO);
    sm_set_initial_status(RECORD_WAKEUP_SROUCE);
    // sm_set_initial_status(CAT1_INIT);
}

void main_business_entry(void)
{
    rt_err_t result;
    int status;
    int rv = 0;
    
    if (settings_init(&settings, "/settings.conf", NULL) == 0) {
        settings_params = settings_read(&settings);
        if (!settings_params) {
            settings_params = &settings.params;
        }
        if (settings_params->collect_interval == 0) {
            settings_params->collect_interval = 600;
        }

        log_info("settings_params->collect_interval: %d", settings_params->collect_interval);
    }
 
    stm32_sleep_ack_sem = rt_sem_create("stm32_sleep_ack_sem", 0, RT_IPC_FLAG_FIFO);
    rtc_init();

    start_tick_ms = rt_tick_get_millisecond();
    log_debug("start tick ms: %d", start_tick_ms);

    sm_init();
    data_save_as_file_init(&fs, 0, ".dat", "/data", -1);

    board_pins_init();

    while (1)
    {
        status = sm_get_status();
        switch (status)
        {
            case RECORD_WAKEUP_SROUCE:
                record_wakeup_source();
                sm_set_status(EXTERNAL_DEVICES_INIT);
                break;
            case EXTERNAL_DEVICES_INIT:
                external_devices_init();
                sm_set_status(COLLECT_SENSOR_DATA);
                break;
            case COLLECT_SENSOR_DATA:
                collect_sensor_data();
                sensor_pwron_pin_enable(PIN_LOW);
                sm_set_status(NBIOT_INIT);
                break;
            case NBIOT_INIT:
                nbiot_init();
                sm_set_status(NBIOT_WAIT_NETWORK_RDY);
                break;
            case NBIOT_WAIT_NETWORK_RDY:
                nbiot_set_cfun_mode(0);
                log_debug("nbiot_set_cfun_mode 0");
                rt_thread_mdelay(200);
                nbiot_set_cfun_mode(1);
                log_debug("nbiot_set_cfun_mode 1");
                rv = nbiot_wait_network_ready();
                if (rv == NBIOT_NETWORK_NOT_RDY) {
                    nbiot_deinit();
                    save_sensor_data();
                    sm_set_status(SLEEP);
                }
                else if (rv == NBIOT_NETWORK_RETRY) {
                    nbiot_set_cfun_mode(0);
                    log_debug("nbiot_set_cfun_mode 0");
                    rt_thread_mdelay(200);
                    nbiot_set_cfun_mode(1);
                    log_debug("nbiot_set_cfun_mode 1");
                    sm_set_status(NBIOT_WAIT_NETWORK_RDY);
                }
                else {
                    save_sensor_data();
                    sm_set_status(NBIOT_WAIT_SERVER_CONNECT);
                }
                break;
            case NBIOT_WAIT_SERVER_CONNECT:
                rv = nbiot_wait_server_connect_ready();
                if (rv == NBIOT_SERVER_CONNECT_NOT_RDY) {
                    nbiot_deinit();
                    sm_set_status(SLEEP);
                }
                else if (rv == NBIOT_SERVER_CONNECT_RDY) {
                    sm_set_status(NBIOT_REPORT_CONTROL_DATA);
                }
                else if (rv == NBIOT_SERVER_CONNECT_RETRY) {
                    sm_set_status(NBIOT_WAIT_SERVER_CONNECT);
                }
                else if (rv == NBIOT_NETWORK_RETRY) {
                    sm_set_status(NBIOT_WAIT_NETWORK_RDY);
                }
                else {
                    // pass
                }
                break;
            case NBIOT_REPORT_CONTROL_DATA:
                rv = nbiot_report_ctrl_data_to_server();
                if (rv == NBIOT_REPORT_CTRL_DATA_FAILED || rv == NBIOT_REPORT_CTRL_DATA_SUCCESS) {
                    sm_set_status(NBIOT_REPORT_SENSOR_DATA);
                }
                else if (rv == NBIOT_REPORT_CTRL_DATA_RETRY) {
                    sm_set_status(NBIOT_REPORT_CONTROL_DATA);
                }
                else if (rv == NBIOT_SERVER_CONNECT_RETRY) {
                    sm_set_status(NBIOT_WAIT_SERVER_CONNECT);
                }
                else  {
                    // pass
                }
                break;
            case NBIOT_REPORT_SENSOR_DATA:
                rv = nbiot_report_sensor_data_to_server();
                if (rv == NBIOT_REPORT_SENSOR_DATA_FAILED || rv == NBIOT_REPORT_SENSOR_DATA_SUCCESS) {
                    nbiot_deinit();
                    sm_set_status(CAT1_INIT);
                }
                else if (rv == NBIOT_REPORT_SENSOR_DATA_RETRY) {
                    sm_set_status(NBIOT_REPORT_SENSOR_DATA);
                }
                else if (rv == NBIOT_SERVER_CONNECT_RETRY) {
                    sm_set_status(NBIOT_WAIT_SERVER_CONNECT);
                }
                else {
                    // pass
                }
                break;
            case CAT1_INIT:
                if (cat1_init() != RT_EOK) {
                    sm_set_status(SLEEP);
                }
                else {
                    sm_set_status(CAT1_WAIT_NETWORK_RDY);
                }
                break;
            case CAT1_WAIT_NETWORK_RDY:
                rv = cat1_wait_network_ready();
                if (rv == CAT1_NETWORK_NOT_RDY) {
                    cat1_set_cfun_mode(0);
                    rt_thread_mdelay(200);
                    cat1_set_cfun_mode(1);
                    sm_set_status(CAT1_WAIT_NETWORK_RDY);
                }
                else if (rv == CAT1_NETWORK_RDY) {
                    sm_set_status(CAT1_UPLOAD_FILE);
                }
                else if (rv == CAT1_NETWORK_ERROR) {
                    cat1_deinit();
                    sm_set_status(SLEEP);
                }
                break;
            case CAT1_UPLOAD_FILE:
                rv = cat1_upload_file();
                if (rv == CAT1_UPLOAD_FILE_SUCCESS || rv == CAT1_UPLOAD_FILE_ERROR) {
                    sm_set_status(SLEEP);
                }
                else {
                    sm_set_status(CAT1_UPLOAD_FILE);
                }
                break;
            case SLEEP:
                stm32_sleep();
                break;
            default:
                log_warn("unknown status: %d", status);
                break;
        }
    }
}


#include "esp32.h"
void test_esp32()
{
    extern void nand_to_esp32(void);
    nand_to_esp32();

    esp32_power_pin_init();
    esp32_power_on();

    esp32_at_client_init();

}

cJSON *read_json_obj_from_file(const char *file_path)
{
    FILE *fd = NULL;
    int length = 0;

    fd = fopen(file_path, "rb");
    if (!fd) {
        log_debug("open file \"%s\" failed", file_path);
        return NULL;
    }
    
    fseek(fd, 0, SEEK_END);
    length = ftell(fd);
    fseek(fd, 0, SEEK_SET);
    log_debug("got \"%s\" file length: %d", file_path, length);

    char *json_string = (char *)malloc(length + 1);
    memset(json_string, 0, length + 1);
    fread(json_string, 1, length, fd);
    log_debug("read json string: %s\n", json_string);
    fclose(fd);

    cJSON *root = cJSON_Parse(json_string);

    free(json_string);
    return root;
}

void save_json_obj_to_file(const char *file_path, cJSON *root)
{
    FILE *fd = NULL;
    char *data = NULL;
    fd = fopen(file_path, "wb");
    if (fd) {
        data = cJSON_PrintUnformatted(root);
        fwrite(data, 1, strlen(data), fd);
        fclose(fd);
    }
}


void test_read_json()
{
    cJSON *file_upload_event = read_json_obj_from_file("/upload_files.json");
    char *json_string = cJSON_Print(file_upload_event);
    rt_kprintf("file upload event:\n%s", json_string);
    free(json_string);
    cJSON_Delete(file_upload_event);
}
